<?php


namespace App\classes;


class Blog
{
    public $blogs=[];

    public function __construct()
    {
        $this->blogs=[
            0=>[
                "id"=>1,
                "title"=>"চিনি এই আছে, এই নেই, দাম ইচ্ছেমতো",
                "image"=>"assets/images/sugar.webp",
                "description"=>"চিরাজধানীর খুচরা দোকানগুলোতে কখনো চিনি পাওয়া যাচ্ছে, কখনো পাওয়া যাচ্ছে না। বিক্রেতারা বলছেন, পাইকারি দোকান থেকে মাঝেমধ্যে তাঁরা চিনি পান। পরিমাণে অল্প। সেই চিনি দ্রুতই বিক্রি হয়ে যায়। ফলে বেশির ভাগ সময় দোকানে চিনি থাকে না।"
            ],
            1=>[
                "id"=>2,
                "title"=>"ক্রিকেট ছাড়ার পর কোকেন ধরেছিলেন ওয়াসিম আকরাম",
                "image"=>"assets/images/wasim.webp",
                "description"=>"চপাকিস্তান কিংবদন্তির আত্মজীবনীর নাম ‘সুলতান: আ মেমোইর’, বাংলায় যার মানে সুলতান: একটি স্মৃতিকথা। অস্ট্রেলিয়ার সাংবাদিক গিডেয়ন হেইগের সহযোগিতায় লেখা বইয়ে আকরাম জানিয়েছেন, খেলোয়াড়িজীবনকে বিদায় বলার পর কোকেনে আসক্ত হয়ে পড়েছিলেন তিনি।"
            ],
            2=>[
                "id"=>3,
                "title"=>"প্রধান শেয়ারবাজার ডিএসইতে লেনদেনে বিলম্ব",
                "image"=>"assets/images/share.webp",
                "description"=>"দেশের প্রধান শেয়ারবাজার ঢাকা স্টক এক্সচেঞ্জে (ডিএসই) লেনদেন বন্ধ রয়েছে। সপ্তাহের প্রথম কার্যদিবসে আজ রোববার নির্ধারিত সময় সকাল সাড়ে ৯ টায় লেনদেন  শুরু করতে পারেনি ডিএসই। তবে দিনের স্বাভাবিক লেনদেন শুরু করতে না পারার আনুষ্ঠানিক কোনো কারণ জানাতে পারেনি সংস্থাটি।  "
            ],
        ];
    }

    public function getAllBlog(){
        return $this->blogs;
    }

    public function getBlogById($id){
        foreach ($this->blogs as $blog){
            if($blog["id"]==$id){
                return $blog;
            }
        }
    }

}